app/controllers/delivers_controller.rb

SELECT "delivers".* FROM "delivers"
---
        def index
            delivers = Deliver.all