app/controllers/notations_controller.rb

SELECT "notations".* FROM "notations"
---
    def index
        notations = Notation.all

INSERT INTO "notations" ("deliver_id", "nom", "commentaire", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["deliver_id", 1], ["nom", "op;m"], ["commentaire", "pom"], ["created_at", "2021-01-20 18:46:08.514131"], ["updated_at", "2021-01-20 18:46:08.514131"]]
---
    def create
        notation = Notation.create(notation_params)